#pragma once
#include <vector>
#include <random>

#include <Gameplay/helper.h>

namespace Looting
{
	namespace Tables
	{
		std::vector<std::vector<UObject*>> WeaponTable;
		std::vector<UObject*> ConsumableTable;
		std::vector<UObject*> AmmoTable;
		static bool bInitialized = false;

		static int GetWeaponTableIdx()
		{
			// int Random = UKismetMathLibrary::RandomIntegerInRange(0, 100);
			std::random_device rd; // obtain a random number from hardware
			std::mt19937 gen(rd()); // seed the generator
			std::uniform_int_distribution<> distr(0, 100); // define the range

			auto Random = distr(gen);

			if (Random <= 50)
				return 0;

			if (Random <= 75)
				return 1;

			if (Random <= 90)
				return 2;

			if (Random <= 97)
				return 3;

			if (Random <= 100)
				return 4;

			return 0;
		}

		static UObject* GetWeaponDef()
		{
			auto& Table = WeaponTable[GetWeaponTableIdx()];

			while (true)
			{
				auto Weapon = Table[rand() % (Table.size())];

				if (Weapon)
					return Weapon;
			}
		}

		static UObject* GetAmmoDef()
		{
			while (true)
			{
				auto Ammo = AmmoTable[rand() % (AmmoTable.size())];

				if (Ammo)
					return Ammo;
			}
		}

		static UObject* GetConsumableDef()
		{
			while (true)
			{
				auto Consumable = ConsumableTable[rand() % (ConsumableTable.size())];

				if (Consumable)
					return Consumable;
			}
		}

		static DWORD WINAPI Init(LPVOID)
		{
			if (bInitialized)
				return 0;

			bInitialized = true;


			ConsumableTable.push_back(FindObject(_("/Game/Athena/Items/Consumables/StickyGrenade/Athena_StickyGrenade.Athena_StickyGrenade")));
			ConsumableTable.push_back(FindObject(_("/Game/Athena/Items/Consumables/ThrownConsumables/Athena_IceGrenade.Athena_IceGrenade")));
			ConsumableTable.push_back(FindObject(_("/Game/Athena/Items/Consumables/Bush/Athena_Bush.Athena_Bush")));

			if (Engine_Version < 422)
			{
				AmmoTable.push_back(FindObject(_("/Game/Athena/Items/Ammo/AthenaAmmoDataRockets.AthenaAmmoDataRockets")));
				AmmoTable.push_back(FindObject(_("/Game/Athena/Items/Ammo/AthenaAmmoDataShells.AthenaAmmoDataShells")));
				AmmoTable.push_back(FindObject(_("/Game/Athena/Items/Ammo/AthenaAmmoDataBulletsMedium.AthenaAmmoDataBulletsMedium")));
				AmmoTable.push_back(FindObject(_("/Game/Athena/Items/Ammo/AthenaAmmoDataBulletsLight.AthenaAmmoDataBulletsLight")));
				AmmoTable.push_back(FindObject(_("/Game/Athena/Items/Ammo/AthenaAmmoDataBulletsHeavy.AthenaAmmoDataBulletsHeavy")));
			}
			else
			{
				static UObject* AthenaAmmoDataRockets = FindObject(_("FortAmmoItemDefinition /Game/Athena/Items/Ammo/AmmoDataRockets.AmmoDataRockets"));
				static UObject* AthenaAmmoDataShells = FindObject(_("FortAmmoItemDefinition /Game/Athena/Items/Ammo/AthenaAmmoDataShells.AthenaAmmoDataShells"));
				static UObject* AthenaAmmoDataBulletsMedium = FindObject(_("FortAmmoItemDefinition /Game/Athena/Items/Ammo/AthenaAmmoDataBulletsMedium.AthenaAmmoDataBulletsMedium"));
				static UObject* AthenaAmmoDataBulletsLight = FindObject(_("FortAmmoItemDefinition /Game/Athena/Items/Ammo/AthenaAmmoDataBulletsLight.AthenaAmmoDataBulletsLight"));
				static UObject* AthenaAmmoDataBulletsHeavy = FindObject(_("FortAmmoItemDefinition /Game/Athena/Items/Ammo/AthenaAmmoDataBulletsHeavy.AthenaAmmoDataBulletsHeavy"));
			
				AmmoTable.push_back(AthenaAmmoDataRockets);
				AmmoTable.push_back(AthenaAmmoDataShells);
				AmmoTable.push_back(AthenaAmmoDataBulletsMedium);
				AmmoTable.push_back(AthenaAmmoDataBulletsLight);
				AmmoTable.push_back(AthenaAmmoDataBulletsHeavy);
			}

			return 0;
		}

		inline UObject* GetRandomDefinition(bool* bIsConsum = nullptr) // NOT ammo
		{
			auto Random = rand() % 10;
			auto bIsConsumable = Random == 1 || Random == 2 || Random == 3 || Random == 0;

			if (bIsConsum)
				*bIsConsum = bIsConsumable;

			return bIsConsumable ? Tables::GetConsumableDef() : Tables::GetWeaponDef();
		}

		static DWORD WINAPI FillVendingMachines(LPVOID)
		{
			// Some vending machines are empty. We have to get all of the vending machines and then set the slot manually?

			static auto BuildingItemCollectorClass = FindObject(_("Class /Script/FortniteGame.BuildingItemCollectorActor"));

			if (BuildingItemCollectorClass)
			{
				auto Actors = Helper::GetAllActorsOfClass(BuildingItemCollectorClass);

				std::cout << _("Filling ") << Actors.Num() << _(" vending machines!\n");

				for (int i = 0; i < Actors.Num(); i++)
				{
					auto Actor = Actors[i];

					if (Actor)
					{
						struct FCollectorUnitInfo
						{
							class UFortWorldItemDefinition* InputItem;                                                // 0x0000(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
							char pad[0x0028];
							UObject* OverrideInputItemTexture;                                 // 0x0028(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
							unsigned char                                      bUseDefinedOutputItem : 1;                                // 0x0030(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
							unsigned char                                      UnknownData00[0x7];                                       // 0x0031(0x0007) MISSED OFFSET
							UObject* OutputItem;                                               // 0x0038(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
							TArray<__int64>                      OutputItemEntry;                                          // 0x0040(0x0010) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient)
							struct FName                                       OverrideOutputItemLootTierGroupName;                      // 0x0050(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
							char pad1[0xA8];
							UObject* OverrideOutputItemTexture;                                // 0x0100(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
						};
						TArray<FCollectorUnitInfo>* ItemCollections = Actor->Member<TArray<FCollectorUnitInfo>>(_("ItemCollections")); // CollectorUnitInfo

						if (ItemCollections)
						{
							static UObject* CollectorUnitInfoClass = FindObject(_("ScriptStruct /Script/FortniteGame.CollectorUnitInfo"));
							static std::string CollectorUnitInfoClassName = _("ScriptStruct /Script/FortniteGame.CollectorUnitInfo");

							if (!CollectorUnitInfoClass)
							{
								CollectorUnitInfoClassName = _("ScriptStruct /Script/FortniteGame.ColletorUnitInfo"); // die fortnite
								CollectorUnitInfoClass = FindObject(CollectorUnitInfoClassName); // Wedc what this value is
							}

							static auto OutputItemOffset = FindOffsetStruct(CollectorUnitInfoClassName, _("OutputItem"));

							std::cout << _("Offset: ") << OutputItemOffset << '\n';
